app/Models/DatasetModel.php

SELECT `dataset`.`iddataset`, `dataset`.`sepal_length`, `dataset`.`sepal_width`, `petal_length`, `petal_width`, `kelas`.`kelas`, `jenisdata`.`jenis`
FROM `dataset`
JOIN `kelas` ON `kelas`.`idkelas` = `dataset`.`idkelas`
JOIN `jenisdata` ON `jenisdata`.`idjenis` = `dataset`.`idjenis`
WHERE `jenisdata`.`idjenis` = 1
---
    public function getDataWithKelass(){
        return $this->join('kelas', 'kelas.idkelas = dataset.idkelas')
                    ->join('jenisdata', 'jenisdata.idjenis = dataset.idjenis')
                    ->select('dataset.iddataset, dataset.sepal_length, dataset.sepal_width, petal_length, petal_width , kelas.kelas, jenisdata.jenis')
                    ->where('jenisdata.idjenis',1)
                    ->findAll();